In [25]:
import pandas as pd

data = pd.DataFrame({'Name': ['Andres', 'Mary', 'Juan','Alex', 'Jean', 'Charlie', 'Joy', 'Ana', 'Peter'],
                     'Age': [30, 24, 22, 31, 30, 22, 16, 22, 44]}
                      )

In [26]:
data

   Age     Name
0   30   Andres
1   24     Mary
2   22     Juan
3   31     Alex
4   30     Jean
5   22  Charlie
6   16      Joy
7   22      Ana
8   44    Peter

In [27]:
# Shows the first 5 rows
data.head()

   Age    Name
0   30  Andres
1   24    Mary
2   22    Juan
3   31    Alex
4   30    Jean

In [36]:
# Using column attribute
data.columns

Index(['Age', 'Name'], dtype='object')

In [28]:
# Using unique function
data['Age'].unique()

array([30, 24, 22, 31, 16, 44], dtype=int64)

In [29]:
# Using len function
len(data['Age'].unique())

6

In [30]:
# Using nunique instead of len and unique
data['Age'].nunique()

6

In [31]:
# Better way to count values instead of groupby
data['Age'].value_counts()

22    3
30    2
31    1
44    1
24    1
16    1
Name: Age, dtype: int64

In [32]:
# Conditional selection
data[data['Age']>25]

   Age    Name
0   30  Andres
3   31    Alex
4   30    Jean
8   44   Peter

In [33]:
# Using apply method
def by_2(value):
    return value * 2

data['Age'].apply(by_2)

0    60
1    48
2    44
3    62
4    60
5    44
6    32
7    44
8    88
Name: Age, dtype: int64

In [34]:
# Using lambda with apply function

data['Age'].apply(lambda x: x*2)

0    60
1    48
2    44
3    62
4    60
5    44
6    32
7    44
8    88
Name: Age, dtype: int64

In [35]:
# Dropping columns 
# axis 1 for columns. Use inplace = True for deleting
data.drop('Age', axis = 1)

      Name
0   Andres
1     Mary
2     Juan
3     Alex
4     Jean
5  Charlie
6      Joy
7      Ana
8    Peter

In [37]:
# Sorting values
data.sort_values('Name')

   Age     Name
3   31     Alex
7   22      Ana
0   30   Andres
5   22  Charlie
4   30     Jean
6   16      Joy
2   22     Juan
1   24     Mary
8   44    Peter

In [38]:
# Checking for nulls

data.isnull()

     Age   Name
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
5  False  False
6  False  False
7  False  False
8  False  False